app/Controllers/Administrador.php

    public function administrarPacientes()
    {
        $userInfoModel = model('UserInfoModel');
        $data['usersInfo'] = $userInfoModel->findAll();

        $usersModel = model('UsersModel');
        $data['users'] = $usersModel->findAll();


         /*
            Los siguientes modelos son para recuperar la información de los médicos que atienden
            a cada paciente
        */
        $medicoPacienteModel = model ('MedicoPacienteModel');
        $data['medicosPaciente'] = $medicoPacienteModel->findAll();
        $medicoModel = model ('MedicoModel');
        $data['medicos'] = $medicoModel->findAll();
        $data['userInfoMedicos'] = $userInfoModel->findAll();
        $data['userMedicos'] = $usersModel->findAll();
---
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function buscarPacientes()
    {
        $userInfoModel = model('UserInfoModel');
        $usersModel = model('UsersModel');

        if (isset($_GET['columnaBusquedaPaciente']) && isset($_GET['valIngresado'])) {
            $columnaBusquedaPaciente = $_GET['columnaBusquedaPaciente'];
            $valIngresado = $_GET['valIngresado'];

            if ($columnaBusquedaPaciente == 'nombre') {
                $data['usersInfo'] = $userInfoModel->like('primerNombre', $valIngresado)
                    ->orlike('segundoNombre', $valIngresado)
                    ->orlike('apellidoPaterno', $valIngresado)
                    ->orlike('apellidoMaterno', $valIngresado)
                    ->findAll();
                $data['users'] = $usersModel->findAll();
---
SELECT *
FROM `userinfo`
WHERE `primerNombre` LIKE '%carlos%' ESCAPE '!'
OR  `segundoNombre` LIKE '%carlos%' ESCAPE '!'
OR  `apellidoPaterno` LIKE '%carlos%' ESCAPE '!'
OR  `apellidoMaterno` LIKE '%carlos%' ESCAPE '!'
AND `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

        } else {
            $columnaBusquedaPaciente = "";
            $valIngresado = "";
            $data['usersInfo'] = $userInfoModel->findAll();
            $data['users'] = $usersModel->findAll();
---
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

            a cada paciente
        */
        $medicoPacienteModel = model ('MedicoPacienteModel');
        $data['medicosPaciente'] = $medicoPacienteModel->findAll();
        $medicoModel = model ('MedicoModel');
        $data['medicos'] = $medicoModel->findAll();
        $data['userInfoMedicos'] = $userInfoModel->findAll();
        $data['userMedicos'] = $usersModel->findAll();
---
SELECT *
FROM `medico_paciente`
WHERE `medico_paciente`.`deleted_at` IS NULL
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function editarPaciente($id)
    {
        $pacienteModel = model('PacienteModel');
        $data['paciente'] = $pacienteModel->find($id);

        $usersModel = model('UsersModel');
        $data['users'] = $usersModel->where('paciente',($data['paciente']->id))->find();

        $userInfoModel = model('UserInfoModel');
        $data['usersInfo'] = $userInfoModel->where('id',($data['users'][0]->id))->find();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '36'
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
AND `userinfo`.`id` = '36'

    public function editarPacienteDireccion($id)
    {
        $pacienteModel = model('PacienteModel');
        $direccionModel = model('DireccionModel');

        $validation = \Config\Services::validation();

        $rules =[
            'seguro'=>'required|max_length[50]|min_length[3]|alpha_space',
            'sangre'=>'required|max_length[3]|min_length[2]|alpha_numeric_punct',
            'alergia'=>'required|max_length[250]|min_length[7]',
            'fechaRevision'=>'required|valid_date',
            'motivoRevision'=>'required|max_length[250]|alpha_numeric_punct',
            'habitosToxicos'=>'required',
            'condicionesPrevias'=>'required',
        ];

        $data = [
            "id" => $_POST['id'],
            "primerNombre" => $_POST['primerNombre'],
            "segundoNombre" => $_POST['segundoNombre'],
            "apellidoPaterno" => $_POST['apellidoPaterno'],
            "apellidoMaterno" => $_POST['apellidoMaterno'],
            "genero" => $_POST['genero'],
            "telefono" => $_POST['telefono'],
            "CURP" => $_POST['CURP'],
            "correo" => $_POST['correo'],
            "username" => $_POST['username'],
            "contraseña" => $_POST['contraseña'],
            "foto" => $_POST['foto'],
            "paciente" => $pacienteModel->find($id),
            "sangre" => $_POST['sangre'],
            "alergia" => $_POST['alergia'],
            "fechaRevision" => $_POST['fechaRevision'],
            "motivoRevision" => $_POST['motivoRevision'],
            "direccion" => $direccionModel->where('userinfo', $_POST['id'])->findAll(),
            "seguro" => $_POST['seguro'],
            "habitosToxicos" => $_POST['habitosToxicos'],
            "condicionesPrevias" => $_POST['condicionesPrevias'],
            'validation'=>$validation
        ];
---
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL

        } else {
            $columnaBusquedaMedicamento = "";
            $valIngresado = "";
            $data['medicamentos'] = $medicamentosModel->findAll();
---
SELECT *
FROM `medicamentos`
WHERE `medicamentos`.`deleted_at` IS NULL

    public function administrarConsultas()
    {
        $consultasModel = model('ConsultasModel');
        $data['consultas'] = $consultasModel->findAll();

        $recetaModel = model('RecetaModel');
        $data['recetas'] = $recetaModel->findAll();
---
SELECT *
FROM `consultas`
WHERE `consultas`.`deleted_at` IS NULL
SELECT *
FROM `receta`
WHERE `receta`.`deleted_at` IS NULL

    public function agregarMedicoConsulta(){

            $userInfoModel = model('UserInfoModel');
            $userModel = model('UsersModel');
            $medicoModel = model ('MedicoModel');

            $data['medicos'] = $medicoModel->findAll();
            $data['userInfoMedicos'] = $userInfoModel->findAll();
            $data['userMedicos'] = $userModel->findAll();
---
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function insertConsulta()
    {
        $validation = \Config\Services::validation();

        $rules =[
            'lugar'=>'required|max_length[15]|min_length[3]|string',
            'hora'=>'max_length[15]',
            'fecha'=>'required|max_length[15]|string',
            'motivo'=>'required|max_length[250]|string',
        ];

        if(!$this->validate($rules)){
            $data['medicoPaciente'] = $_POST['idMedicoPaciente'];

            $medicoPacienteModel = model('MedicoPacienteModel');
            $userInfoModel = model('UserInfoModel');
        $userModel = model('UsersModel');
        $pacienteModel = model ('PacienteModel');

        $data['medicoPaciente'] = $medicoPacienteModel->find($_POST['idMedicoPaciente']);
        $data['pacientes'] = $pacienteModel->findAll();
        $data['userInfoPacientes'] = $userInfoModel->findAll();
        $data['userPacientes'] = $userModel->findAll();
---
SELECT *
FROM `medico_paciente`
WHERE `medico_paciente`.`deleted_at` IS NULL
AND `medico_paciente`.`id` = '67'
SELECT *
FROM `paciente`
WHERE `paciente`.`deleted_at` IS NULL
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function administrarRecetas()
    {
        $recetaModel = model('RecetaModel');
        $data['recetas'] = $recetaModel->findAll();

        $medicamentoModel = model('MedicamentosModel');
        $data['medicamentos'] = $medicamentoModel->findAll();

        $recetaMedicamentoModel = model('RecetaMedicamentoModel');
        $data['recetaMedicamentos'] = $recetaMedicamentoModel->findAll();

        $consultasModel = model('ConsultasModel');
        $data['consultas'] = $consultasModel->findAll();
---
SELECT *
FROM `receta`
WHERE `receta`.`deleted_at` IS NULL
SELECT *
FROM `medicamentos`
WHERE `medicamentos`.`deleted_at` IS NULL
SELECT *
FROM `receta_medicamento`
WHERE `receta_medicamento`.`deleted_at` IS NULL
SELECT *
FROM `consultas`
WHERE `consultas`.`deleted_at` IS NULL

   public function cancelarReceta($id){
        $recetaModel = model('RecetaModel');
        $data = array(
            "status" => 0,
            "updated_at" => date('Y-m-d'),
        );

        $recetaModel->update($id, $data);
---
UPDATE `receta` SET `status` = 0, `updated_at` = '2023-11-19'
WHERE `receta`.`id` IN ('74')