app/Controllers/Administrador.php

SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
---
        else {
            $columnaBusquedaPaciente ="";
            $valIngresado="";
            $data['usersInfo']=$userInfoModel->findAll();

SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
AND `userinfo`.`id` = '3'
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '3'
SELECT `paciente`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '3'
SELECT *
FROM `paciente`
WHERE `paciente`.`deleted_at` IS NULL
AND `paciente`.`id` = '1'
---
    public function editarPaciente($id){
        $userInfoModel = model('UserInfoModel');
        $data['usersInfo'] = $userInfoModel->find($id);

        $usersModel = model('UsersModel');
        $data['users'] = $usersModel->find($id);

        $idP= $usersModel->select('paciente')->find($id)->paciente;
        $pacienteModel = model('PacienteModel');
        $data['paciente'] = $pacienteModel->find($idP);

SELECT *
FROM `paciente`
WHERE `paciente`.`deleted_at` IS NULL
AND `paciente`.`id` = '3'
---
    public function editarPaciente2($id){
        $pacienteModel = model('PacienteModel');

        $data = [
            "id"=>$_POST['id'],
            "primerNombre"=>$_POST['primerNombre'],
            "segundoNombre"=>$_POST['segundoNombre'],
            "apellidoPaterno"=>$_POST['apellidoPaterno'],
            "apellidoMaterno"=>$_POST['apellidoMaterno'],
            "genero"=>$_POST['genero'],
            "telefono"=>$_POST['telefono'],
            "CURP"=>$_POST['CURP'],
            "correo"=>$_POST['correo'],
            "username"=>$_POST['username'],
            "contraseña"=>$_POST['contraseña'],
            "foto"=>$_POST['foto'],
            "paciente"=>$pacienteModel->find($id)

SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
---
    public function administrarMedicos(){
        $userInfoModel = model('UserInfoModel');
        $data['usersInfo'] = $userInfoModel->findAll();

        $usersModel = model('UsersModel');
        $data['users'] = $usersModel->findAll();

        $medicoModel = model('MedicoModel');
        $data['medicos'] = $medicoModel->findAll();

SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
---
    public function buscarMedicos(){
        $userInfoModel = model('UserInfoModel');

        $usersModel = model('UsersModel');

        $medicoModel = model('MedicoModel');

        if(isset($_GET['columnaBusquedaMedicos']) && isset($_GET['valIngresado'])){
            $columnaBusquedaMedicos = $_GET['columnaBusquedaMedicos'];
            $valIngresado = $_GET['valIngresado'];

            if($columnaBusquedaMedicos=='nombre'){
                $data['usersInfo']=$userInfoModel->like('primerNombre',$valIngresado)
                            ->orlike('segundoNombre',$valIngresado)
                            ->orlike('apellidoPaterno',$valIngresado)
                            ->orlike('apellidoMaterno',$valIngresado)
                            ->findAll();
                $data['users'] = $usersModel->findAll();
                $data['medicos'] = $medicoModel->findAll();
            }

            if($columnaBusquedaMedicos=='especialidad'){
                $data['medicos']=$medicoModel->like('especialidad',$valIngresado)
                            ->findAll();
                $data['users'] = $usersModel->findAll();
                $data['usersInfo'] = $userInfoModel->findAll();

SELECT `medico`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '36'
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
AND `medico`.`id` = '22'
---
    public function editarMedico($id){
        $userInfoModel = model('UserInfoModel');
        $data['usersInfo'] = $userInfoModel->find($id);

        $usersModel = model('UsersModel');
        $data['users'] = $usersModel->find($id);

        $idM= $usersModel->select('medico')->find($id)->medico;
        $medicosModel = model('MedicoModel');
        $data['medico'] = $medicosModel->find($idM);

SELECT *
FROM `direccion`
WHERE `userinfo` = '36'
AND `direccion`.`deleted_at` IS NULL
---
    public function editarMedico2($id){
        $direccionModel = model ('DireccionModel');
        $data = [
            "primerNombre"=>$_POST['primerNombre'],
            "segundoNombre"=>$_POST['segundoNombre'],
            "apellidoPaterno"=>$_POST['apellidoPaterno'],
            "apellidoMaterno"=>$_POST['apellidoMaterno'],
            "genero"=>$_POST['genero'],
            "telefono"=>$_POST['telefono'],
            "correo"=>$_POST['correo'],
            "username"=>$_POST['username'],
            "password"=>$_POST['password'],
            "foto"=>$_POST['foto'],
            "especialidad"=>$_POST['especialidad'],
            "diasLaborales"=>$_POST['diasLaborales'],
            "turno"=>$_POST['turno'],
            "id"=>$id,
            "direccion"=>$direccionModel->where('userinfo',$id)->findAll(),

UPDATE `userinfo` SET `deleted_at` = '2023-11-16 01:17:43'
WHERE `id` IN ('36')
AND `deleted_at` IS NULL
UPDATE `users` SET `deleted_at` = '2023-11-16 01:17:43'
WHERE `id` IN ('36')
AND `deleted_at` IS NULL
UPDATE `medico` SET `deleted_at` = '2023-11-16 01:17:43'
WHERE `id` IN ('36')
AND `deleted_at` IS NULL
---
    public function eliminarMedico($id){
        $direccionModel = model('DireccionModel');
        $direccionModel->delete(['userinfo'=>$id]);

        $userInfoModel = model('UserInfoModel');
        $userInfoModel->delete($id);

        $usersModel = model('UsersModel');
        $usersModel->delete($id);

        $medicoModel = model('MedicoModel');
        $medicoModel->delete(['medico'=>$id]);