app/Controllers/Administrador.php

    public function administrarPacientes()
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean administradores
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == TRUE) {
            return redirect('/', 'refresh');
        }

        $userInfoModel = model('UserInfoModel');
        $data['usersInfo'] = $userInfoModel->findAll();

        $usersModel = model('UsersModel');
        $data['users'] = $usersModel->findAll();


        /*
           Los siguientes modelos son para recuperar la información de los médicos que atienden
           a cada paciente
       */
        $medicoPacienteModel = model('MedicoPacienteModel');
        $data['medicosPaciente'] = $medicoPacienteModel->findAll();
        $medicoModel = model('MedicoModel');
        $data['medicos'] = $medicoModel->findAll();
---
SELECT *
FROM `medico_paciente`
WHERE `medico_paciente`.`deleted_at` IS NULL
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL

                "condicionesPrevias" => $_POST['condicionesPrevias'],
                "created_at" => date('Y-m-d')
            ];
            $pacienteModel->insert($dataPaciente);
---
INSERT INTO `paciente` (`CURP`, `statusSeguro`, `tipoSangre`, `alergia`, `fechaRevision`, `motivoRevision`, `habitoToxico`, `condicionesPrevias`, `created_at`) VALUES ('QWE123RTY456ZXCASD', 'Ninguno', 'O+', 'Ninguna', '3151-05-04', 'Preventivo', ('Ninguno'), ('Ninguna'), '2023-12-05')

                "paciente" => $pacienteModel->getInsertID(),
                "created_at" => date('Y-m-d')
            ];
            $usersModel->insert($dataUser);
---
INSERT INTO `users` (`correo`, `username`, `password`, `paciente`, `created_at`) VALUES ('a@a.com', 'asaih', 'kjljvhljk', 33, '2023-12-05')

                "foto" => $_POST['foto'],
                "created_at" => date('Y-m-d')
            ];
            $userInfoModel->insert($dataUserInfo);
---
INSERT INTO `userinfo` (`id`, `primerNombre`, `segundoNombre`, `apellidoPaterno`, `apellidoMaterno`, `genero`, `telefono`, `foto`, `created_at`) VALUES (54, 'YoMero', 'Mero', 'Caguamero', 'sdflkjs', 'M', '123-456-7894', 'https://www.lavanguardia.com/files/og_thumbnail/uploads/2019/03/22/5fa51e59418f8.jpeg', '2023-12-05')

                "userinfo" => $usersModel->getInsertID(),
                "created_at" => date('Y-m-d')
            ];
            $direccionModel->insert($dataDireccion);
---
INSERT INTO `direccion` (`estado`, `municipio`, `colonia`, `calle`, `noInt`, `noExt`, `CP`, `tipo`, `userinfo`, `created_at`) VALUES ('Puebla', 'kjblfjkb', 'ljvljbl', 'kvlj', '4', '3', '73960', 'Casa', 54, '2023-12-05')

    public function editarPacienteDatosMedicos($id)
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean administradores
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == TRUE) {
---
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL

        if (!$this->validate($rules)) {
            $direccionModel = model('DireccionModel');

            $data = [
                "primerNombre" => $_POST['primerNombre'],
                "segundoNombre" => $_POST['segundoNombre'],
                "apellidoPaterno" => $_POST['apellidoPaterno'],
                "apellidoMaterno" => $_POST['apellidoMaterno'],
                "genero" => $_POST['genero'],
                "telefono" => $_POST['telefono'],
                "correo" => $_POST['correo'],
                "username" => $_POST['username'],
                "password" => $_POST['password'],
                "foto" => $_POST['foto'],
                "especialidad" => $_POST['especialidad'],
                "diasLaborales" => $_POST['diasLaborales'],
                "turno" => $_POST['turno'],
                "id" => $_POST['id'],
                "direccion" => $direccionModel->where('userinfo', $_POST['id'])->findAll(),
                'validation' => $validation
            ];
---
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL

    public function agregarMedicos()
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean administradores
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == TRUE) {
---
SELECT *
FROM `paciente`
WHERE `paciente`.`deleted_at` IS NULL
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL