app/Controllers/Home.php

            }

            if($tipo == 'admin'){
                $data['usuario']= $userModel->like('username',$username)
                            ->Like('password',$password)
                            ->where('paciente',NULL)
                            ->where('medico',NULL)
                            ->findAll();
---
SELECT *
FROM `users`
WHERE `username` LIKE '%Miguel%' ESCAPE '!'
AND  `password` LIKE '%root%' ESCAPE '!'
AND `paciente` IS NULL
AND `medico` IS NULL
AND `users`.`deleted_at` IS NULL