app/Controllers/Medico.php

SELECT *
FROM `medico_paciente`
WHERE `medico` = '1'
AND `medico_paciente`.`deleted_at` IS NULL
SELECT *
FROM `consultas`
WHERE `fecha` IS NULL
AND `consultas`.`deleted_at` IS NULL
SELECT *
FROM `consultas`
WHERE `consultas`.`deleted_at` IS NULL
SELECT *
FROM `receta`
WHERE `receta`.`deleted_at` IS NULL
---
    public function administrarConsultas()
    {
        $session = \Config\Services::session();

        $medicoPacienteModel = model('MedicoPacienteModel');
        $data['medicosPaciente'] = $medicoPacienteModel->where('medico',($session->get('idMedico')))->findAll();

        $consultasModel = model('ConsultasModel');
        $data['consultasPendientes'] = $consultasModel->where('fecha',NULL)->findAll();

        $data['consultas'] = $consultasModel->findAll();

        $recetaModel = model('RecetaModel');
        $data['recetas'] = $recetaModel->findAll();

SELECT *
FROM `medicamentos`
WHERE `medicamentos`.`deleted_at` IS NULL
SELECT *
FROM `consultas`
WHERE `consultas`.`deleted_at` IS NULL
AND `consultas`.`id` = '61'
---
    public function completarConsulta($id){
        $medicamentosModel = model('MedicamentosModel');
        $data['medicamentos'] = $medicamentosModel->findAll();

        $consultaModel = model ('ConsultasModel');


        $data['consulta'] = $consultaModel->find($id);