app/Controllers/Paciente.php

    public function administrarMedicos()
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean médicos
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == FALSE) {
            return redirect('/', 'refresh');
        }

        $userInfoModel = model('UserInfoModel');
        $userModel = model('UsersModel');
        $medicoMOdel = model('MedicoModel');
        $medicoPacientModel = model('MedicoPacienteModel');
        $session = \Config\Services::session();

        $data['idPaciente'] = $session->get('idPaciente');
        $data['medicos'] = $medicoMOdel->findAll();
        $data['userInfoMedicos'] = $userInfoModel->findAll();
        $data['userMedicos'] = $userModel->findAll();
        $data['medicoPacientes'] = $medicoPacientModel->where('paciente', $data['idPaciente'])->findAll();
---
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
SELECT *
FROM `userinfo`
WHERE `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `medico_paciente`
WHERE `paciente` = '23'
AND `medico_paciente`.`deleted_at` IS NULL

    public function medicoSaberMas($id)
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean médicos
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == FALSE) {
            return redirect('/', 'refresh');
        }

        $userInfoModel = model('UserInfoModel');
        $userModel = model('UsersModel');
        $medicoModel = model('MedicoModel');
        $consultasModel = model('ConsultasModel');

        $data['user'] = $userModel->where('paciente', $id)->findAll();
        $data['userinfo'] = $userInfoModel->where('id', ($data['user'][0]->id))->findAll();
        $data['medico'] = $medicoModel->find($id);
        $data['consultas'] = $consultasModel->where('medico_paciente', ($_GET['IDmedicoPaciente']))->findAll();
---
SELECT *
FROM `userinfo`
WHERE `id` = '23'
AND `userinfo`.`deleted_at` IS NULL
SELECT *
FROM `medico`
WHERE `medico`.`deleted_at` IS NULL
AND `medico`.`id` = '15'
SELECT *
FROM `consultas`
WHERE `medico_paciente` = '39'
AND `consultas`.`deleted_at` IS NULL

    public function agregarConsulta($idMedico)
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean médicos
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == FALSE) {
            return redirect('/', 'refresh');
        }


        $session = \Config\Services::session();

        $medicoPacienteModel = model('MedicoPacienteModel');

        $data['medicoPaciente'] = $medicoPacienteModel->findAll();
        $ExistenciaDeRelacion = 0;
        $ultimoID = 0;
        foreach ($data['medicoPaciente'] as $medicoPaciente) {
            if (($medicoPaciente->paciente == ($session->get('idPaciente'))) && ($medicoPaciente->medico == $idMedico)) {
                $ExistenciaDeRelacion = $medicoPaciente->id;
            }
            $ultimoID = $ultimoID + 1;
        }

        if ($ExistenciaDeRelacion != 0) {
            $data['medicoPaciente'] = $medicoPacienteModel->find($ExistenciaDeRelacion);
---
SELECT *
FROM `medico_paciente`
WHERE `medico_paciente`.`deleted_at` IS NULL
SELECT *
FROM `medico_paciente`
WHERE `medico_paciente`.`deleted_at` IS NULL
AND `medico_paciente`.`id` = '39'

    public function administrarRecetas()
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean médicos
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == FALSE) {
            return redirect('/', 'refresh');
        }


        $session = \Config\Services::session();

        $medicoPacienteModel = model('MedicoPacienteModel');
        $data['medicosPaciente'] = $medicoPacienteModel->where('paciente', ($session->get('idPaciente')))->findAll();

        $recetaModel = model('RecetaModel');
        $data['recetas'] = $recetaModel->findAll();

        $medicamentoModel = model('MedicamentosModel');
        $data['medicamentos'] = $medicamentoModel->findAll();

        $recetaMedicamentoModel = model('RecetaMedicamentoModel');
        $data['recetaMedicamentos'] = $recetaMedicamentoModel->findAll();

        $consultasModel = model('ConsultasModel');
        $data['consultas'] = $consultasModel->findAll();
---
SELECT *
FROM `medico_paciente`
WHERE `paciente` = '23'
AND `medico_paciente`.`deleted_at` IS NULL
SELECT *
FROM `receta`
WHERE `receta`.`deleted_at` IS NULL
SELECT *
FROM `medicamentos`
WHERE `medicamentos`.`deleted_at` IS NULL
SELECT *
FROM `receta_medicamento`
WHERE `receta_medicamento`.`deleted_at` IS NULL
SELECT *
FROM `consultas`
WHERE `consultas`.`deleted_at` IS NULL