app/Controllers/Paciente.php

    public function medicoSaberMas($id)
    {
        //Proteger la ruta para que no accedan personas sin iniciar sesión
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/', 'refresh');
        }

        //Proteger la ruta para que no accedan usuarios que no sean médicos
        if ($session->get('idMedico') == TRUE || $session->get('idPaciente') == FALSE) {
            return redirect('/', 'refresh');
        }

        $userInfoModel = model('UserInfoModel');
        $userModel = model('UsersModel');
        $medicoModel = model('MedicoModel');
        $consultasModel = model('ConsultasModel');

        $data['user'] = $userModel->where('medico', $id)->findAll();
---
SELECT *
FROM `users`
WHERE `medico` = '15'
AND `users`.`deleted_at` IS NULL